app/views/items/_card.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('506f9eb1-33be-4b51-a75c-510588c28c5c', 'a6b4c29f-4ec9-4d13-b6ad-94e9211e54aa', 'c48d05bc-7a7a-4a63-ae6d-ac81faa4b78d')
---
        <div class="w-6 h-6 rounded-full bg-gradient-to-br from-violet-500 to-fuchsia-500 flex items-center justify-center shadow-sm">
          <span class="text-white text-[9px] font-black"><%= item.user.name.first.upcase %></span>