app/views/items/index.html.erb

SELECT COUNT(*) FROM "items"
---
        <div class="text-center">
          <p class="text-2xl font-black text-white"><%= Item.count %>+</p>

SELECT COUNT(*) FROM "users"
---
        <div class="text-center">
          <p class="text-2xl font-black text-white"><%= User.count %></p>

SELECT COUNT(*) FROM "loans"
---
        <div class="text-center">
          <p class="text-2xl font-black text-white"><%= Loan.count %></p>