app/views/items/show.html.erb

          <div class="w-11 h-11 rounded-xl bg-gradient-to-br from-violet-500 to-fuchsia-500 flex items-center justify-center shadow-md shadow-purple-500/15">
            <span class="text-white font-bold text-sm"><%= @item.user.name.first.upcase %></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" = '506f9eb1-33be-4b51-a75c-510588c28c5c' LIMIT 1