app/controllers/items_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('506f9eb1-33be-4b51-a75c-510588c28c5c', 'a6b4c29f-4ec9-4d13-b6ad-94e9211e54aa', 'c48d05bc-7a7a-4a63-ae6d-ac81faa4b78d')
SELECT COUNT(*) FROM "items"
SELECT COUNT(*) FROM "users"
---
  def index
    @items = Item.available
                 .includes(:user, images_attachments: :blob)
                 .order(created_at: :desc)
                 .page(params[:page])

INSERT INTO "items" ("available", "category", "condition", "created_at", "description", "flagged", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @item = current_user.items.build(item_params)

    if @item.save