app/controllers/loans_controller.rb

  def create
    @loan = @item.loans.build(loan_params)
    @loan.borrower = current_user

    if @loan.save
---
INSERT INTO "loans" ("borrower_id", "created_at", "end_date", "item_id", "message", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_item
    @item = Item.find(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", "ccb70799-ccb7-4504-80da-8732d90c4f49"], ["LIMIT", 1]]