app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    @invitation = Invitation.find_by_valid_token(params[:invitation_token])

    if @invitation
      @user.neighborhood = @invitation.neighborhood
    end

    if @user.save
---
INSERT INTO "users" ("address", "created_at", "email", "location", "name", "neighborhood_id", "password_digest", "role", "updated_at") VALUES ('234 church street ', '2026-05-23 19:52:57.492906', 'arju@gmail.com', NULL, 'Arjun', NULL, '$2a$12$bNg19i7Umfw1w/b2yIXMI.4O7Hr6ldmN8LgRHsEJmAdvoRwcr1FmW', 0, '2026-05-23 19:52:57.492906') RETURNING "id"