app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email_address]&.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'demo@gmail.com' LIMIT 1