app/models/invitation.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'newneighbor@example.com' AND "users"."neighborhood_id" = '2e377bc2-62af-4459-b37c-9d94bb98738c' LIMIT 1
---
  def invitee_not_already_member
    if User.exists?(email: invitee_email, neighborhood: neighborhood)