app/models/loan.rb

  def no_overlapping_loans
    return if start_date.blank? || end_date.blank?

    overlapping = item.loans.where.not(status: %i[declined returned])
                      .where("start_date < ? AND end_date > ?", end_date, start_date)

    errors.add(:base, "This item is already booked for the selected dates") if overlapping.exists?
---
SELECT 1 AS one FROM "loans" WHERE "loans"."item_id" = '03942287-99ad-4aa3-b883-e797d9fdd628' AND "loans"."status" NOT IN (4, 3) AND (start_date < '2026-05-22' AND end_date > '2026-05-19') LIMIT 1